In [2]:
import pandas as pd
import numpy as np
titanic_survival = pd.read_csv("titanic_train.csv")
titanic_survival.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
age = titanic_survival["Age"]
# print (age.loc[0:10])
# 返回一个布尔数组，缺失的位置为True
age_is_null = pd.isnull(age)
# print (age_is_null)
age_null_true = age[age_is_null]
# print (age_null_true)
# 用python自带函数len()获取缺失值个数
print (len(age_null_true))

177

In [7]:
# 求平均年龄(注意;如果值元素里面含有nan那么结果肯定是nan)
mean_age = sum(titanic_survival["Age"])/len(titanic_survival["Age"])
print (mean_age)

nan

In [11]:
correct_age = titanic_survival["Age"][age_is_null == False]

corrent_mean_age = sum(correct_age)/len(correct_age)
print (corrent_mean_age)

29.69911764705882

In [13]:
corrent_mean_age = titanic_survival["Age"].mean()
print (corrent_mean_age)

# 但是这样并不是一个很好的做法，因为存在缺失值，并不一定要把缺失值去掉，可以利用中位数，均值，众数进行填充

29.69911764705882

In [ ]:
passenger_classes = [1,2,3]
fares_by_class = {}